TexasInstruments/mcupsdk-core/examples/drivers/hsmclient/hsm_services/am263x-cc/r5fss0-0_nortos/example.syscfg
firewall_service1.$name                          = "SET_MPU_FIREWALL_REQUEST_0";
firewall_service1.mpu_region.create(6);
firewall_service1.mpu_region[0].$name            = "CONFIG_MPU_FIREWALL_REGION0";
firewall_service1.mpu_region[0].firewallId       = "SCRM2SCRP0_SLV";
firewall_service1.mpu_region[0].startAddr        = 0x502F0000;
firewall_service1.mpu_region[0].endAddr          = 0x502F0FFF;
firewall_service1.mpu_region[0].aidConfig        = ["R5FSS0_0"];
firewall_service1.mpu_region[0].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
firewall_service1.mpu_region[0].regionNum        = 2;
firewall_service1.mpu_region[0].allPermissions   = true;
firewall_service1.mpu_region[1].$name            = "CONFIG_MPU_FIREWALL_REGION1";
firewall_service1.mpu_region[1].firewallId       = "SCRM2SCRP1_SLV";
firewall_service1.mpu_region[1].regionNum        = 2;
firewall_service1.mpu_region[1].endAddr          = 0x502F0FFF;
firewall_service1.mpu_region[1].startAddr        = 0x502F0000;
firewall_service1.mpu_region[1].aidConfig        = ["R5FSS0_0"];
firewall_service1.mpu_region[1].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
firewall_service1.mpu_region[2].$name            = "CONFIG_MPU_FIREWALL_REGION2";
firewall_service1.mpu_region[2].firewallId       = "R5SS0_CORE0_AHB_MST";
firewall_service1.mpu_region[2].regionNum        = 2;
firewall_service1.mpu_region[2].startAddr        = 0x502F0000;
firewall_service1.mpu_region[2].endAddr          = 0x502F0FFF;
firewall_service1.mpu_region[2].aidConfig        = ["R5FSS0_0"];
firewall_service1.mpu_region[2].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
firewall_service1.mpu_region[3].$name            = "CONFIG_MPU_FIREWALL_REGION3";
firewall_service1.mpu_region[3].firewallId       = "R5SS0_CORE1_AHB_MST";
firewall_service1.mpu_region[3].startAddr        = 0x502F0000;
firewall_service1.mpu_region[3].endAddr          = 0x502F0FFF;
firewall_service1.mpu_region[3].aidConfig        = ["R5FSS0_0"];
firewall_service1.mpu_region[3].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
firewall_service1.mpu_region[3].regionNum        = 2;
firewall_service1.mpu_region[4].$name            = "CONFIG_MPU_FIREWALL_REGION4";
firewall_service1.mpu_region[4].firewallId       = "R5SS1_CORE0_AHB_MST";
firewall_service1.mpu_region[4].regionNum        = 2;
firewall_service1.mpu_region[4].startAddr        = 0x502F0000;
firewall_service1.mpu_region[4].endAddr          = 0x502F0FFF;
firewall_service1.mpu_region[4].aidConfig        = ["R5FSS0_0"];
firewall_service1.mpu_region[4].allPermissions   = true;
firewall_service1.mpu_region[5].$name            = "CONFIG_MPU_FIREWALL_REGION5";
firewall_service1.mpu_region[5].firewallId       = "R5SS1_CORE1_AHB_MST";
firewall_service1.mpu_region[5].regionNum        = 2;
firewall_service1.mpu_region[5].startAddr        = 0x502F0000;
firewall_service1.mpu_region[5].endAddr          = 0x502F0FFF;
firewall_service1.mpu_region[5].aidConfig        = ["R5FSS0_0"];
firewall_service1.mpu_region[5].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];

firewall_service2.$name                    = "SET_MPU_FIREWALL_REQUEST_1";
firewall_service2.mpu_region.create(1);
firewall_service2.mpu_region[0].$name      = "CONFIG_MPU_FIREWALL_REGION6";
firewall_service2.mpu_region[0].firewallId = "MBOX_RAM_SLV";
firewall_service2.mpu_region[0].endAddr    = 0x720007FF;
firewall_service2.mpu_region[0].aidConfig  = ["R5FSS0_1","R5FSS1_0","R5FSS1_1"];
firewall_service2.mpu_region[0].startAddr  = 0x72000400;
